Repository: dc4ll/mediaspip_scripts
Catalog: locale/*/LC_MESSAGES/mediaspip.po
Languages: fr

source: End alternc
fr: Création des liens symboliques des binaires pour AlternC terminée

source: End apache
fr: Préconfiguration d'Apache terminée

source: End debian-multimedia
fr: Le dépôt Debian Multimédia a été correctement activé.

source: End dependances
fr: Fin de l'installation des dépendances

source: End faac
fr: Installation de FAAC terminée

source: End faad
fr: Installation de FAAD terminée

source: End ffmpeg
fr: Installation de FFMpeg terminée

source: End ffmpeg2theora
fr: Installation de ffmpeg2theora terminée

source: End flvtool++
fr: Installation de Flvtool++ terminée

source: End flvtool2
fr: Installation de Flvtool2 terminée

source: End installation generale
fr: L'installation est terminée.

source: End lame
fr: Installation de lame terminée

source: End libtheora
fr: Installation de libtheora terminée

source: End libvpx
fr: Installation de libvpx terminée

source: End mediainfo
fr: Installation de MediaInfo terminée

source: End opencore
fr: Installation de opencore-amr terminée

source: End php-imagick
fr: Installation de php-imagick terminée

source: End rtmpdump
fr: Installation de rtmpdump terminée

source: End scons
fr: Installation de Scons terminée

source: End x264
fr: Installation de x264 terminée

source: End xvid
fr: Installation de xvid terminée

source: End yasm
fr: Installation de Yasm terminée

source: Erreur apt debian-multimedia
fr: Vous devez activer les dépôts Debian Multimedia pour APT.

source: Erreur fichier $FICHIER
fr: Le fichier suivant n'existe pas : $FICHIER

source: Erreur installation regarde log
fr: Erreur : quelquechose s'est mal passé, veuillez consulter le fichier de log.

source: Erreur installation regarde log $LOG
fr: Erreur : quelquechose s'est mal passé, veuillez consulter le fichier de log ($LOG).

source: Erreur internet connexion
fr: Il semble que vous ne soyez pas connecté à Internet

source: Erreur langue inexistante
fr: Erreur : cette langue n'est pas prise en compte (fr|en)

source: Erreur langue non set
fr: Erreur : aucune langue n'est spécifiée avec l'option --lang

source: Erreur mediaspip type disponible $TYPEDEMANDE
fr: Erreur : votre type d'installation de MediaSPIP n'est pas disponible ($TYPEDEMANDE)

source: Erreur option cpus numerique
fr: Erreur : votre option --cpus n'est pas numérique

source: Erreur option cpus trop $CPU_NB
fr: Erreur : votre serveur n'a pas autant de cpus ($CPU_NB)

source: Erreur script distro inconnue
fr: Erreur : la version de votre distribution est inconnue

source: Erreur script distro non suportee $DISTRIB $DISTRO
fr: Erreur : votre distribution n'est pas supportée ($DISTRIB $DISTRO)

source: Erreur script pkg-config
fr: Erreur : le programme pkg-config n'est pas disponible. Vous pouvez l'installer manuellement via la commande : apt-get -y install pkg-config

source: Erreur script protocole svn
fr: Erreur : le protocole svn:// ne semble pas être accessible de votre machine.

source: Erreur script root
fr: Erreur : ce script doit être lancé en tant que root

source: Erreur valide LOG
fr: Erreur : modifiez la variable LOG pour l'emplacement de votre choix.

source: Erreur valide SPIP
fr: Erreur : modifiez la variable SPIP pour l'emplacement de votre choix.

source: Erreur valide SRC_INSTALL
fr: Erreur : modifiez la variable SRC_INSTALL pour l'emplacement de votre choix.

source: Help message
fr: EXPLICATIONS : Ce script installera toutes les dépendances logicielles requises pour l'installation de MediaSPIP. Il installera ensuite le logiciels SPIP (http://www.spip.net) ainsi que les extensions nécessaires dans le répertoire d'installation spécifié. PARAMETRES DU SCRIPT Les paramètres basiques sont : --help : affiche l'aide du script --version : affiche la version du script --allways-yes : passer les questions préalables au script --log : emplacement du fichier de log de l'installation (/var/log/mediaspip_install.log par défaut) --cpus : nombre de core du ou des processeurs que les phases de compilations pourront utiliser (par défaut, on utilise l'ensemble des cores donnés dans le fichier /proc/cpuinfo) Les paramètres dédiés aux installations de logiciels : --src_install : répertoire où seront téléchargée les sources des logiciels à installér (/usr/local/src) --dep_version : mode d'installation des logiciels. Elle est utilisée pour l'installation de rtmpdump, FFMpeg et FFMpeg2theora, les autres logiciels étant arbitrairement installés de l'une ou l'autre manière. Cette option peut avoir deux valeurs différentes : dev (valeur par défaut) : installation à jour en récupérant les sources possibles via les logiciels de gestion de version que sont svn et git stable (ou tout autre valeur) : essaye de n'installer que des releases fixes des logiciels récupérées via une archive figée pour une version --disable-ffmpeg : ne pas installer FFMpeg. Plusieurs installations sont affectées par cette configuration car elles dépendent de FFMpeg : FFMpeg lui-même FFMpeg2theora --disable-apache : éviter de préconfigurer le serveur Apache, l'installation de PHP5 et des classes nécessaires sera quand même réalisée --disable-alternc : dans le cas où AlternC est détecté sur votre serveur, cela permet de ne pas prendre en compte cette détection et de ne pas créer les liens symboliques nécessaires au safe_mode Les paramètres spécifiques à SPIP et MediaSPIP sont : --disable_mediaspip : ne pas installer ni mettre à jour SPIP et les extensions / plugins / thèmes de MediaSPIP --spip : définir le répertoire d'installation final de SPIP et des éléments de MediaSPIP (/var/www/mediaspip) --spip-svn : définir le dépot svn que l'on utilise pour le code de SPIP (svn://trac.rezo.net/spip/branches/spip-2.1) --spip-user : définir l'utilisateur Unix à qui vont appartenir les fichiers de MediaSPIP (www-data) --spip-group : définir le groupe Unix à qui vont appartenir les fichiers de MediaSPIP (www-data) --spip-type : définir le type d'installation que l'on souhaite, plusieurs valeurs sont possibles : ferme_full : installe l'ensemble sous la forme d'une ferme (avec le plugin de mutualisation) ainsi que l'ensemble des plugins optionnels et thèmes dits compatibles (choix par défaut) ferme : installe l'ensemble sous la forme d'une ferme (avec le plugin de mutualisation) sans les plugins optionnels ni les thèmes full : installe une version standalone avec l'ensemble des plugins optionnels et thèmes dits compatibles minimal : installe une version standalone sans les plugins optionnels et thèmes dits compatibles PLUS D'INFOS http://www.mediaspip.net http://www.spip.net http://www.ffmpeg.org

source: Info $PLUGIN change depot $NEW_DEPOT
fr: Changement de dépot ($NEW_DEPOT) pour $PLUGIN

source: Info $PLUGIN change serveur $NEW_DEPOT
fr: Le plugin $PLUGIN a changé de serveur ($NEW_DEPOT).

source: Info $TYPE telecharge $PLUGIN
fr: Téléchargement de $PLUGIN ($TYPE)

source: Info MediaSPIP installe
fr: Les fichiers de MediaSPIP sont installés

source: Info MediaSPIP non installe
fr: MediaSPIP ne sera pas installé

source: Info SPIP change depot $SPIP_SVN
fr: Changement de dépot SVN de SPIP vers $SPIP_SVN

source: Info SPIP changement droits $SPIP_USER $SPIP_GROUP
fr: Modifications des droits des fichiers, utilisateur "$SPIP_USER", groupe "$SPIP_GROUP"

source: Info SPIP copie htaccess
fr: Copie du fichier htaccess de SPIP

source: Info SPIP extensions
fr: Installation des extensions de MediaSPIP

source: Info SPIP extensions maj
fr: Mise à jour des extensions de MediaSPIP

source: Info SPIP install mutualisation
fr: Installation du plugin de mutualisation

source: Info SPIP install plugins
fr: Installation des plugins optionnels de MediaSPIP

source: Info SPIP install revision $REVISIONSPIP
fr: SPIP est installé à la révision $REVISIONSPIP

source: Info SPIP install securite
fr: Installation de l'écran de sécurité

source: Info SPIP installation
fr: Ce script installera SPIP dans le répertoire :

source: Info SPIP maj
fr: Mise à jour de SPIP

source: Info SPIP maj mutualisation
fr: Mise à jour du plugin de mutualisation

source: Info SPIP maj plugins
fr: Mise à jour des plugins optionnels de MediaSPIP

source: Info SPIP maj securite
fr: Mise à jour de l'écran de sécurité

source: Info SPIP plugins
fr: Installation des plugins SPIP optionnels

source: Info SPIP repertoire lib
fr: Création du répertoire lib/

source: Info SPIP repertoire sites
fr: Création du répertoire sites/

source: Info SPIP suppression cache css
fr: Suppression des caches CSS

source: Info SPIP suppression cache html
fr: Suppression des caches

source: Info SPIP suppression cache js
fr: Suppression des caches javascript

source: Info SPIP suppression cache plugins
fr: Suppression des caches de metas

source: Info SPIP telechargement
fr: Téléchargement de SPIP

source: Info SPIP themes
fr: Installation des thèmes de MediaSPIP

source: Info SPIP themes maj
fr: Mise à jour des themes de MediaSPIP

source: Info a jour $SOFTWARE $VERSION
fr: Le logiciel $SOFTWARE est à jour à la version $VERSION

source: Info a jour ffmpeg
fr: FFmpeg semble déjà à jour

source: Info a jour ffmpeg2theora version $VERSION
fr: ffmpeg2theora est installé à la version $VERSION

source: Info a jour flvtool++ $VERSION
fr: FLVtool++ semble déjà à la version $VERSION

source: Info a jour lame $VERSION
fr: LAME semble déjà à la version $VERSION

source: Info a jour libtheora $VERSION
fr: Libtheora semble déjà à la version $VERSION

source: Info a jour libvpx $VERSION
fr: Libvpx semble déjà à la version $VERSION

source: Info a jour mediainfo $VERSION
fr: MediaInfo semble déjà à la version $VERSION

source: Info a jour opencore $VERSION
fr: Libopencore-amr semble déjà à la version $VERSION

source: Info a jour php-imagick
fr: php-imagick semble déjà à jour

source: Info a jour rtmpdump $REVISION
fr: rtmpdump semble déjà à la révision $REVISION

source: Info a jour rtmpdump $VERSION
fr: rtmpdump semble déjà à la version $VERSION

source: Info a jour x264
fr: x264 semble déjà à jour

source: Info a jour yasm $VERSION
fr: Yasm semble déjà à la version $VERSION

source: Info apache mime fichier
fr: Installation du fichier de configuration des types mime supplémentaires

source: Info apache mod deflate
fr: Activation du module mod_deflate

source: Info apache mod deflate fichier
fr: Installation du fichier de configuration du mod_deflate

source: Info apache mod expires
fr: Activation du module mod_expires

source: Info apache mod expires fichier
fr: Installation du fichier de configuration du mod_expires

source: Info apache mod headers
fr: Activation du module mod_headers

source: Info apache mod rewrite
fr: Activation du mod_rewrite

source: Info apache reload
fr: Rechargement d'Apache

source: Info apt debian-multimedia copie
fr: Insertion du dépôt dans le fichier /etc/apt/sources.list .

source: Info apt debian-multimedia installation cle
fr: Installation de la clé GPG du dépôt.

source: Info apt debian-multimedia question auto
fr: Le dépôt APT Debian Multimédia est nécessaire pour continuer. Voulez-vous que le script l'active automatiquement ?

source: Info apt maj base
fr: Mise à jour de la base d'APT

source: Info apt maj paquets
fr: Mise à jour et installation des paquets via APT

source: Info compilation configure
fr: Configuration

source: Info compilation install
fr: Installation

source: Info compilation make
fr: Compilation

source: Info debut faac install $VERSION
fr: Téléchargement, compilation et installation de FAAC à la version $VERSION

source: Info debut faac update $VERSION
fr: Mise à jour de FAAC à la version $VERSION

source: Info debut faad install $VERSION
fr: Téléchargement, compilation et installation de FAAD à la version $VERSION

source: Info debut faad update $VERSION
fr: Mise à jour de FAAD à la version $VERSION

source: Info debut ffmpeg install
fr: Téléchargement, compilation et installation de FFMpeg

source: Info debut ffmpeg update
fr: Mise à jour, compilation et installation de FFMpeg

source: Info debut ffmpeg2theora install
fr: Téléchargement, compilation et installation de ffmpeg2theora

source: Info debut ffmpeg2theora update
fr: Mise à jour, compilation et installation de ffmpeg2theora

source: Info debut flvtool++
fr: Téléchargement, compilation et installation de flvtool++

source: Info debut flvtool2
fr: Téléchargement, compilation et installation de flvtool2

source: Info debut lame install $VERSION
fr: Téléchargement, compilation et installation de lame version $VERSION

source: Info debut lame update $VERSION
fr: Recompilation et réinstallation de lame version $VERSION

source: Info debut libtheora install $VERSION
fr: Téléchargement, compilation et installation de libtheora version $VERSION

source: Info debut libtheora update $VERSION
fr: Recompilation et réinstallation de libtheora version $VERSION

source: Info debut libvpx install $VERSION
fr: Compilation et installation de libvpx version $VERSION

source: Info debut mediainfo install $VERSION
fr: Téléchargement, compilation et installation de mediainfo version $VERSION

source: Info debut mediainfo update $VERSION
fr: Recompilation et réinstallation de mediainfo version $VERSION

source: Info debut opencore install $VERSION
fr: Téléchargement, compilation et installation de opencore-amr version $VERSION

source: Info debut opencore update $VERSION
fr: Recompilation et réinstallation de opencore-amr version $VERSION

source: Info debut php-imagick install
fr: Installation de php-imagick

source: Info debut php-imagick update
fr: Mise à jour de php-imagick

source: Info debut rtmpdump install
fr: Téléchargement, compilation et installation de rtmpdump

source: Info debut scons install $VERSION
fr: Téléchargement, compilation et installation de Scons version $VERSION

source: Info debut scons update $VERSION
fr: Téléchargement, compilation et installation de Scons version $VERSION

source: Info debut x264 install
fr: Téléchargement, compilation et installation de x264

source: Info debut x264 update
fr: Mise à jour, compilation et installation de x264

source: Info debut xvidcore install $VERSION
fr: Téléchargement, compilation et installation de xvidcore à la version $VERSION

source: Info debut xvidcore update $VERSION
fr: Mise à jour de xvidcore à la version $VERSION

source: Info debut yasm install
fr: Téléchargement, compilation et installation de Yasm

source: Info distro version $DISTRIB $DISTRO
fr: Vous utilisez une distribution $DISTRIB $DISTRO

source: Info ffmpeg revision $REVISION
fr: FFMpeg est installé à la révision $REVISION

source: Info ffmpeg version $VERSION
fr: FFMpeg est installé à la version $VERSION

source: Info ffmpeg2theora revision $REVISION
fr: ffmpeg2theora est installé à la révision $REVISION

source: Info ffmpeg2theora version $VERSION
fr: ffmpeg2theora est installé à la version $VERSION

source: Info log installation
fr: Ce script enregistrera ses logs dans :

source: Info mediainfo compil install
fr: Compilation et installation

source: Info mediaspip installation $VERSION_INSTALL
fr: Programme d'installation de MediaSPIP version $VERSION_INSTALL Copyright (c) 2010 - kent1 Ce programme est un logiciel libre distribué sous licence GNU/GPL. Pour plus de détails voir le fichier COPYING.txt.

source: Info options disable_alternc
fr: [INFO] Vous avez décidé de ne pas utiliser AlternC

source: Info options disable_apache
fr: [INFO] Vous avez décidé de ne pas préconfigurer Apache

source: Info options disable_ffmpeg
fr: [INFO] Vous avez décidé de ne pas installer ou mettre à jour FFMpeg

source: Info options disable_mediaspip
fr: [INFO] Vous avez décidé de ne pas installer ou mettre à jour SPIP et MediaSPIP

source: Info options no_question
fr: [INFO] Vous avez décidé de valider automatiquement toutes les questions

source: Info php max_upload $PHP_UPLOAD_SIZE
fr: Configuration de la taille maximale d'upload via PHP à $PHP_UPLOAD_SIZE

source: Info source installation
fr: Ce script téléchargera les sources des logiciels dans :

source: Info yum intallation epel
fr: Prise en compte du dépot EPEL par Yum

source: Info yum maj base
fr: Mise à jour de la base de donnée des paquets de Yum

source: Info yum maj paquets
fr: Mise à jour des paquets via Yum

source: Question alternc
fr: Utilisez vous AlternC pour MediaSPIP ?

source: Question valider
fr: Oui ou non (o/n) ?

source: Titre apache
fr: ############################################ # Préconfiguration d'Apache # ############################################

source: Titre dependances logicielles
fr: ############################################ # Installation des dépendances logicielles # ############################################

source: Titre ffmpeg
fr: ############################################ # Installation de FFMpeg # ############################################

source: Titre ffmpeg2theora
fr: ############################################ # Installation de FFMpeg2Theora # ############################################

source: Titre spip mediaspip
fr: ############################################ # Installation de SPIP et MediaSPIP # ############################################

source: Titre x264
fr: ############################################ # Installation de libx264 et x264 # ############################################
